Nick Williams
LINIX Part:
Script started on 2021-10-10 22:25:14-04:00 [TERM="linux" TTY="/dev/pts/2" COLUMNS="80" LINES="25"]
nick1996@pe15:~$ cd m[Kcs341/mp1
nick1996@pe15:~/cs341/mp1$ cd cs341/mp1[8Pexitmake tutorcd cs341/mp1[8Pexitscript[2Pexitcat *.cdiscussion.txt[12Pls -al
total 492
drwxrwsr-x 2 nick1996 cs341-1G   4096 Oct 10 22:14 .
drwxrws--- 8 nick1996 cs341-1G   4096 Oct 10 22:22 ..
-rw-r--r-- 1 nick1996 cs341-1G   3926 Oct 10 15:36 cmds.c
-rw-r--r-- 1 nick1996 cs341-1G   7828 Oct 10 22:10 cmds_u.o
-rw-r--r-- 1 nick1996 cs341-1G   2299 Oct 10 21:52 discussion.txt
-rw-r--r-- 1 nick1996 cs341-1G   3045 Sep 16 19:13 makefile
-rw-r--r-- 1 nick1996 cs341-1G 257504 Sep 16 19:13 mp1.pdf
-rw-r--r-- 1 nick1996 cs341-1G 110841 Sep 16 19:13 mp1warmup.pdf
-rw-r--r-- 1 nick1996 cs341-1G  14836 Oct 10 22:13 nick1996@users.cs.umb.edu
-rw-r--r-- 1 nick1996 cs341-1G  13728 Sep 16 19:13 Rubric.docx
-rw-r--r-- 1 nick1996 cs341-1G   2471 Sep 16 19:13 slex.c
-rw-r--r-- 1 nick1996 cs341-1G   1846 Sep 16 19:13 slex.h
-rw-r--r-- 1 nick1996 cs341-1G   5996 Oct 10 22:10 slex_u.o
-rw-r--r-- 1 nick1996 cs341-1G    556 Oct 10 22:10 stubstart.o
-rw-r--r-- 1 nick1996 cs341-1G     97 Sep 16 19:13 stubstart.s
-rw-r--r-- 1 nick1996 cs341-1G   1228 Oct 10 15:36 syms
-rwxr-xr-x 1 nick1996 cs341-1G  21848 Oct 10 22:10 tutor
-rw-r--r-- 1 nick1996 cs341-1G   2321 Oct  9 21:24 tutor.c
-rw-r--r-- 1 nick1996 cs341-1G   6036 Oct 10 22:10 tutor_u.o
-rw-r--r-- 1 nick1996 cs341-1G    638 Oct 10 22:10 usyms
nick1996@pe15:~/cs341/mp1$ ls -alcd cs341/mp1[8Pexitmake tutorcd cs341/mp1[8Pexitscript[2Pexitcat *.cdiscussion.txt
Nick Williams
10/9/2021
MP1 Write-Up
1. I tested my code by using various print statements such as the example given into the assignment page. I found that trying to troubleshoot the segmentation errors using gdb was pointless as it seemed to do nothing. While the SAPC version seemed to work correctly, the LINUX version seemed to not do anything other than display the CMDs commands and execute the help and stop commands. I do not fully know the reason behind this, but it might have something to with the way the tutor is set up.
2. qIf I referenced memory that was nonexistent while running the data, I would simply get a segmentation fault and get booted out of the tutor program. While this was not a regular occurrence when entering existent memory on the SAPC version, the Linux version would always do this, even when entering existing reference memory. 
3. Figuring out the addresses of the following:
a. Md xyz == 00101dfc	 41 f4 ff ff 41 f4 ff ff 41 f4 ff ff 41 f4 ff ff
b. Md pxyz == 00101e0c 9e f3 ff ff 41 f4 ff ff 41 f4 ff ff 41 f4 ff ff; and the value is 6
c. Cmds array: cmds == 0000000c 53 ff 00 f0 53 ff 00 f0 54 ff 00 f0 88 84 00 f0
i. Md == 00101e0c ef f2 ff ff 41 f4 ff ff 46 f3 ff ff 41 f4 ff ff
ii. M == 0000000d ff 00 f0 53 ff 00 f0 54 ff 00 f0 88 84 00 f0 53
iii. D == 0000001d ff 00 f0 a5 fe 00 f0 87 e9 00 f0 56 0d 00 f0 56
d. To change the code to change “s” to “x”, you would need to stop the code from running in the machine. As such, I am unable to change the code while running.
4. The code for the “nm” output starts at 0000001c and ends at 00560d00f0 in SAPC
5. If the code crashed in Unix, you would get a segmentation fault and in SACP, the crash would cause the command line to stop and display an “exception 14” error.
6. In SAPC, the location of the %esp is is 0005788c
7. Nothing much
8.  I learned how to create a tutor program as well find and analyze the addresses of certain inputs using md and ms. As such, I think it was worth the time I put into this project. The part that I found the hardest was trying to get the LINIX version to run properly and the easiest was getting the SAPC version to run, and as such the difference in the difficulty running them as most interesting to me as they seem to run fine with the code I wrote.
nick1996@pe15:~/cs341/mp1$ cat discussion.txt[12Pls -alcd cs341/mp1[8Pexitmake tutorcd cs341/mp1[8Pexitscript[2Pexitcat *.c
/******************************************************************
*
*   file:     cmds.c
*   author:   betty o'neil
*   date:     9/16/2021
*
*   semantic actions for commands called by tutor (cs341, mp1)
*
*   revisions:
*      9/90  eb   cleanup, convert function declarations to ansi
*      9/91  eb   changes so that this can be used for hw1
*      9/02  re   minor changes to quit command
*/
/* the Makefile arranges that #include <..> searches in the right
   places for these headers-- 200920*/

#include <stdio.h>
#include "slex.h"

/*===================================================================*
*
*   Command table for tutor program -- an array of structures of type
*   cmd -- for each command provide the token, the function to call when
*   that token is found, and the help message.
*
*   slex.h contains the typdef for struct cmd, and declares the
*   cmds array as extern to all the other parts of the program.
*   Code in slex.c parses user input command line and calls the
*   requested semantic action, passing a pointer to the cmd struct
*   and any arguments the user may have entered.
*
*===================================================================*/

PROTOTYPE int stop(Cmd *cp, char *arguments);
PROTOTYPE int mem_display(Cmd *cp, char *arguments);
PROTOTYPE int mem_set(Cmd *cp, char *arguments);
PROTOTYPE int help(Cmd *cp, char *arguments);

/* command table */

Cmd cmds[] = {{"md",  mem_display, "Memory display: MD <addr>"},
              {"s",   stop,        "Stop" },
              {"ms",  mem_set,     "Memory Set: MS <addr> <value>"},
              {"h",   help,        "Help: H <command>"}, 

              {NULL,  NULL,        NULL}};  /* null cmd to flag end of table */

char xyz = 6;  /* test global variable  */
char *pxyz = &xyz;  /* test pointer to xyz */
/*===================================================================*
*		command			routines
*
*   Each command routine is called with 2 args, the remaining
*   part of the line to parse and a pointer to the struct cmd for this
*   command. Each returns 0 for continue or 1 for all-done.
*
*===================================================================*/


int stop(Cmd *cp, char *arguments)
{
  return 1;			/* all done flag */
}

/*===================================================================*
*
*   mem_display: display contents of 16 bytes in hex
*
*/

int mem_display(Cmd *cp, char *arguments) {
  unsigned int disnum;
  unsigned int disaddr;
  printf("disaddr = %p  content = %d\n", pxyz, *pxyz);
  if (sscanf(arguments, "%x", &disaddr) == 1) 
  { 
  printf("%08x  ", disaddr);
  for (disnum = 0; disnum < 16; disnum++)
	  printf("%02x ", *(unsigned char*)(disaddr + disnum)); 
  for (disnum = 0; disnum < 16; disnum++)
    printf("%c", (*(unsigned char *)(disaddr + disnum) >= ' ' &&
    *(unsigned char *)(disaddr + disnum) <= '~') ?
    *(unsigned char *)(disaddr + disnum) : '.'); 
  printf("\n"); } else 
  printf("        help message: %s\n", cp->help);
  return 0;			/* not done */ }
/* mem_set: set: display address of the typed value */
int mem_set(Cmd *cp, char *arguments) {
unsigned int setnum;
unsigned int setaddr;
if (sscanf(arguments, "%x %x", &setaddr, &setnum) == 2) { 
  if (setnum < 0x100)
    *(unsigned char *)setaddr = setnum;
  else
    *(unsigned int *)setaddr = setnum;
  printf("Ok/n"); 
} else 
  printf("        help message: %s\n", cp->help);
return 0; } 
/* help: prints out the commands if not known*/
int help(Cmd *cp, char *arguments) {
printf("  cmd   help message\n");
while (*arguments == ' ')
  arguments++;
for(cp = cmds; cp->cmdtoken; cp++)
  if(!strcmp(arguments, cp->cmdtoken)) {
    printf("%8s   %s\n", cp->cmdtoken, cp->help);
  return 0; } 
for(cp = cmds; cp->cmdtoken; cp++)
  printf("%8s   %s\n", cp->cmdtoken, cp->help);
return 0; } 
/******************************************************************
*
*   file:   slex.c
*   author: betty o'neil
*   date:   ?
*
*   simple lexical analyzer, front part of a parser                   
*   --compare to UNIX tool "lex", general lexical analyzer            
*   gets a (space-delimited) token from linebuf and tries to match    
*   it to one of the cmdtokens in the provided cmdtable             
*
*   accepts:       
*         linebuf--string to get token from                         
*         cmdtable--cmdtable to use                                 
*   returns:                                                          
*         *cnum_ptr--command # (offset in cmdtable) or -1 if no match
*         *pos_ptr--new place in linebuf after token match          
*
*   improvements needed:
*         make token matching case independent
*         skip whitespace, not just blanks
*
*   revisions: 
*     9/90 cleanup, convert function headers to ansi form
*
*/

#include <stdio.h>
//#include <string.h>
#include "slex.h"		/* for definition of type cmd */

int slex(char *linebuf,    /* string from user */
         Cmd cmdtable[],   /* cmd table to use */
         int *cnum_ptr,    /* returned command number */
         int *pos_ptr)      /* returned new place in linebuf */
{
  int i = 0;
  char token[MAXTOKENLEN];
  int newpos;

  if (gettoken(linebuf,token,&newpos)<0) /* get token from linebuf */
    return -1;			/* couldn't find token */

  while ((cmdtable[i].cmdtoken != NULL)) {
    if (strcmp(cmdtable[i].cmdtoken,token)==0) {
	*cnum_ptr = i;		/* success--return command # */
	*pos_ptr = newpos;	/* and where we got to in linebuf */
	return 0;
    }
    else
      i++;			/* keep scanning table */
  }
  return -1;			/* no match */
}

/******************************************************************
 * get one space-delimited token from string in linebuf, also return 
 * new position in string 
 */
int gettoken(char *linebuf, char *token, int *pos_ptr)
{
  int i = 0;
  int j = 0;

  while (linebuf[i] == ' ')
    i++;			/* skip blanks */
  while (linebuf[i] != ' '&&linebuf[i]!='\0')
    token[j++] = linebuf[i++];	/* copy chars to token */
  if (j==0)
    return -1;			/* nothing there */
  else
    {
      token[j] = '\0';		/* null-terminate token */
      *pos_ptr = i;		/* return place in linebuf we got to */
      return 0;			/* success */
    }
}
/******************************************************************
*
*   file:     tutor.c
*   author:   eb
*   date:     September, 1990
*
*   Driver for a "tutor" program to mimic and extend the MECB ROM TUTOR.
* 
*   built from betty o'neil's previous version
*
*   revisions:
*   Jan '96: changed prompt to PC-tutor, now mimics floppy-based Tutor
*/

#include <stdio.h>
#include "slex.h" 
/* The preprocessor symbol SAPC is #defined in $pcinc/stdio.h.  This
 * stdio.h is found by i386-gcc because of the -I flag in its compile command
 * in the Makefile.  In the UNIX case, there is no such redirection,
 * so the ordinary stdio.h is used, and it has no SAPC definition.
 */
#ifdef SAPC
#define PROMPT "PC-tutor> "
#else
#define PROMPT "UNIX-tutor> "
#endif
int main(void);
void getcmd(char *, int *, int *);

int main()
{
  int done = 0;
  int cnum,linepos;
  char linebuf[LINELEN];
  Cmd *cp;

  printf("     cmd    help message\n");
  for(cp = cmds; cp->cmdtoken; cp++) 
      printf("%8s    %s\n", cp->cmdtoken, cp->help);

  while (!done) {
    /* get cmd token from user by parsing first part of line in linebuf-- */
    getcmd(linebuf,&cnum,&linepos);
    /* call implementation routine for matched cmd-- */
    /* (remaining part of line to parse starts at linebuf+linepos) */
    done = cmds[cnum].cmdfn(&cmds[cnum], linebuf+linepos); 
  }
  return 0;
}

/***********************************************************************
*
*  getcmd 
*
* Better than scanf--read whole line in, parse resulting string.
* Uses slex package to match cmd token in first part of linebuf 
* and return command # and where to continue parsing.
* Getcmd loops until user provides proper command, so no error return.
*/
void getcmd(char *linebuf, 
             int *cnum_ptr,   /* returned command number */
             int *pos_ptr     /* position in linebuf (after cmd token) */
           )
{
  int done = 0;

  while (!done) {
     printf( PROMPT );
     gets(linebuf);		/* read line from user, null terminate */
     /* match cmd token to get cnum--call slex package to do lookup-- */
     if (slex( linebuf, cmds, cnum_ptr, pos_ptr)==0) 
         done = 1;	/* success in matching cmd */
     else
         printf(" No such command\n");
  }
}
nick1996@pe15:~/cs341/mp1$ cat *.cdiscussion.txt[12Pls -alcd cs341/mp1[8Pexitmake tutorcd cs341/mp1[8Pexitcd cs341/mp1[2Pmake tutorcd cs341/mp1[2Pmake tutor[K[K[K[K[Kcleancd cs341/mp1[2Pmake clean[6Pexitmake cleancd cs341/mp1[8Pexitscript[2Pexitscript[K[K[K[K[K[Kexitcat *.c[3Pexit[K[K[K[Kmake clean
rm -f *.o *.lnx tutor core
nick1996@pe15:~/cs341/mp1$ make tutor
gcc -m32 -Wall -Wno-implicit -Wshadow -g -c -o tutor_u.o tutor.c
gcc -m32 -Wall -Wno-implicit -Wshadow -g -c -o slex_u.o slex.c
gcc -m32 -Wall -Wno-implicit -Wshadow -g -c -o cmds_u.o cmds.c
as --32 -o stubstart.o  stubstart.s
ld -m elf_i386 -o tutor tutor_u.o slex_u.o cmds_u.o stubstart.o -dynamic-linker /lib/ld-linux.so.2 -lc
ld: tutor_u.o: in function `getcmd':
/home/nick1996/cs341/mp1/tutor.c:69: warning: the `gets' function is dangerous and should not be used.
rm -f usyms; nm -vpt x tutor > usyms
nick1996@pe15:~/cs341/mp1$ make
gcc -DSAPC -gdwarf-2 -gstrict-dwarf -march=i586 -m32 -fno-builtin -fno-stack-protector -nostdlib -c -Wall -I/home/cheungr/serl/tutor-linux/include  -c -o tutor.o tutor.c
gcc -DSAPC -gdwarf-2 -gstrict-dwarf -march=i586 -m32 -fno-builtin -fno-stack-protector -nostdlib -c -Wall -I/home/cheungr/serl/tutor-linux/include  -c -o slex.o slex.c
gcc -DSAPC -gdwarf-2 -gstrict-dwarf -march=i586 -m32 -fno-builtin -fno-stack-protector -nostdlib -c -Wall -I/home/cheungr/serl/tutor-linux/include  -c -o cmds.o cmds.c
ld -m elf_i386 -N -Ttext 100100 -o tutor.lnx \
/home/cheungr/serl/tutor-linux/libc/startup0.o /home/cheungr/serl/tutor-linux/libc/startup.o \
tutor.o slex.o cmds.o /home/cheungr/serl/tutor-linux/libc/libc.a
rm -f syms;nm -n tutor.lnx>syms
nick1996@pe15:~/cs341/mp1$ ./tutor
     cmd    help message
      md    Memory display: MD <addr>
       s    Stop
      ms    Memory Set: MS <addr> <value>
       h    Help: H <command>
UNIX-tutor> h md
  cmd   help message
      md   Memory display: MD <addr>
UNIX-tutor> h ms
  cmd   help message
      ms   Memory Set: MS <addr> <value>
UNIX-tutor> g h h
  cmd   help message
       h   Help: H <command>
UNIX-tutor> h s
  cmd   help message
       s   Stop
UNIX-tutor> md 10000
disaddr = 0x804c040  content = 6
Segmentation fault (core dumped)
nick1996@pe15:~/cs341/mp1$ exit
exit

SAPC Part:
Script started on Sun 10 Oct 2021 10:29:36 PM EDT
tuser@tutor-vserver:~$ exitscriptp nick1996@users.cs.umb.edu:cs341/mp1/
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[Kscp nick1996@users.cs.umb.edu:cs341/mp1/tutor.* .
nick1996@users.cs.umb.edu's password: 

tutor.c                                         0%    0     0.0KB/s   --:-- ETA
tutor.c                                       100% 2321     2.3KB/s   00:00    

tutor.lnx                                       0%    0     0.0KB/s   --:-- ETA
tutor.lnx                                     100%   40KB  39.7KB/s   00:01    

tutor.o                                         0%    0     0.0KB/s   --:-- ETA
tutor.o                                       100% 7508     7.3KB/s   00:00    
tuser@tutor-vserver:~$ scp nick1996@users.cs.umb.edu:cs341/mp1/tutor.* .
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[Kscriptp nick1996@users.cs.umb.edu:cs341/mp1/
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[Kls -alscp nick1996@users.cs.umb.edu:cs341/mp1/tutor.* .
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[Kscp typescript nick1996@users.umb.edu:cs341/mp1/tutor.* . 
[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[K

[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cscp nick1996@users.cs.umb.edu:cs341/mp1/tutor.* .
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[Kscp typescript nick1996@users.umb.edu:cs341/mp1/tutor.* . 
[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[K

[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cscriptsh nick1996@users.cs.umb.edu
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[12Pmtip -f tutor.lnxssh nick1996@users.cs.umb.edu
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ccript[K[2Pexitscp typescript nick1996@users.umb.edu:cs341/mp1/tutor.* . 
[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[K

[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cscp nick1996@users.cs.umb.edu:cs341/mp1/tutor.* .
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cls -al[K[2Pexitscp nick1996@users.cs.umb.edu:cs341/mp1/
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cript[Kp nick1996@users.cs.umb.edu:cs341/mp1/
[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[Kls -al
total 236
drwxr-xr-x 8 tuser tuser  4096 Oct  9 21:27 [0m[01;34m.[0m
drwxr-xr-x 4 root  root   4096 Jul 20  2015 [01;34m..[0m
-rw-r--r-- 1 tuser tuser     0 Mar  3  2021 a.out
-rw------- 1 tuser tuser 11639 Oct 10 22:22 .bash_history
-rw-r--r-- 1 tuser tuser   220 Jul 20  2015 .bash_logout
-rw-r--r-- 1 tuser tuser  3184 Jul 20  2015 .bashrc
-rw-r--r-- 1 tuser tuser   461 Mar 11  2021 countc.c
-rwxr-xr-x 1 tuser tuser 30580 Mar 11  2021 [01;32mcount.lnx[0m
-rw-r--r-- 1 tuser tuser   568 Mar 11  2021 count.o
-rw-r--r-- 1 tuser tuser   686 Mar 11  2021 count.s
-rw-r--r-- 1 tuser tuser  1046 Mar 11  2021 count.syms
-rw-r--r-- 1 tuser tuser     0 Feb 24  2021 CR
drwxr-xr-x 2 tuser tuser  4096 Jul 20  2015 [01;34m.emacs.d[0m
drwxr-sr-x 2 tuser tuser  4096 Jul 20  2015 [01;34minclude[0m
drwxr-sr-x 2 tuser tuser  4096 Jul 20  2015 [01;34mlib[0m
-rw-r--r-- 1 tuser tuser  3696 Mar  4  2021 nick1996@users.cs.umb.edu
-rw-r--r-- 1 tuser tuser   675 Jul 20  2015 .profile
drwx------ 2 tuser tuser  4096 Jul 20  2015 [01;34m.ssh[0m
-rw-r--r-- 1 tuser tuser   683 Apr  3  2021 strcpy.s
-rw-r--r-- 1 tuser tuser   927 Apr  3  2021 strncpyc.c
-rwxr-xr-x 1 tuser tuser   582 Apr  3  2021 [01;32mstrncpy.lnx[0m
-rw-r--r-- 1 tuser tuser   640 Apr  3  2021 strncpy.o
-rw-r--r-- 1 tuser tuser   509 Apr  3  2021 strncpy.s
-rwxr-xr-x 1 tuser tuser  5621 Feb  4  2021 [01;32mtest[0m
drwxr-sr-x 2 tuser tuser  4096 Jul 20  2015 [01;34mtestaout[0m
-rw-r--r-- 1 tuser tuser   818 Jul 20  2015 test.c
drwxr-sr-x 2 tuser tuser  4096 Jul 20  2015 [01;34mtestelf[0m
-rw-r--r-- 1 tuser tuser   688 Jul 20  2015 testelf.syms
-rwxr-xr-x 1 tuser tuser 21164 Sep 14 18:54 [01;32mtest.lnx[0m
-rw-r--r-- 1 tuser tuser    67 Jul 20  2015 test.s
-rwxr-xr-x 1 tuser tuser   456 Mar  4  2021 [01;32mtiny.lnx[0m
-rw-r--r-- 1 tuser tuser   480 Mar  4  2021 tiny.o
-rw-r--r-- 1 tuser tuser   127 Mar  4  2021 tiny.s
-rw-r--r-- 1 tuser tuser  2321 Oct 10 22:29 tutor.c
-rwxr-xr-x 1 tuser tuser 40664 Oct 10 22:29 [01;32mtutor.lnx[0m
-rw-r--r-- 1 tuser tuser  7508 Oct 10 22:29 tutor.o
-rw-r--r-- 1 tuser tuser     0 Oct 10 22:29 typescript
tuser@tutor-vserver:~$ cat c*.[K[K[K.[K*.c
/* countc.c: call assembly soubroutine to count c's in string 
    bob wilson
      4/28/2016
     modifed by Ron Cheung
      3/2/2020
 */

#include <stdio.h>
extern int count(char *string, char c);

int main(void)
{
  char s[100];
  char c;
  printf("Enter a string of characters:\n");
  scanf("%s", s);
  printf("Enter a character to count:\n");
  scanf("%c", &c);
  printf("\nThe number of %c's in the string %s is %d\n", c, s, count(s, 
c));
  return 0;
}
/* strncpyc.c: driver for testing assembly language mystrncpy function 

    Bob Wilson

    4/28/2016

     Modified by Ron Cheung 3/4/2019

   */



#include <stdio.h>

extern char *mystrncpy(char *s, char ct, int n);



int main()

{

   char s[10], ct[100];

   int n;



  printf("Enter a string of characters:\n");

  / read all inputs until the \n character */

  scanf("%[^\n]s", ct);

  printf("Enter the number of characters to copy:\n");

  scanf("%d", &n);



  if(s == mystrncpy(s, ct,n))

      printf("The strncpy function returned the correct pointer value.\n");

  else

      printf("The strncpy function returned the wrong pointer value.\n");

  if (!strncmp(s,ct, n))

      printf("The strncpy function copied the data correctly.\n");

  else

      printf("The strncpy function copied the data incorrectly.\n");

  printf("The content of the first %d characters of array s is: %s\n",n, s);

  return 0;

}/* program to show that normal C i/o works on the SA PC */
char msg[] = "testing";
int a;
char buf[80];
main()
{
  char ch;

  a = 3;
  printf("\nWelcome to C on this machine, whatever it is\n\n");
  printf("%s, %s, %d, %d, %d...\n",msg,msg,1,2,a);
  printf("Single-char input test using getchar:\n");
  printf("Now enter a char: ");
  ch = getchar();
  printf("\nIf running without an OS, note how it was picked up and used\n before you typed <CR>.\n");
  printf("\nIf running with an OS, note how it waited until you typed <CR>.\n");
  printf("Here it is, via putchar: ");
  putchar(ch);
  printf("\nMultiple-char input test using scanf:\n");
  printf("Now enter a word: ");
  scanf("%s",buf);
  printf("\nscanf got %s\n",buf);
  printf("\nNow enter a number: ");
  scanf("%d",&a);
  printf("\nscanf got %d\n",a);
}
/******************************************************************

*

*   file:     tutor.c

*   author:   eb

*   date:     September, 1990

*

*   Driver for a "tutor" program to mimic and extend the MECB ROM TUTOR.

* 

*   built from betty o'neil's previous version

*

*   revisions:

*   Jan '96: changed prompt to PC-tutor, now mimics floppy-based Tutor

*/



#include <stdio.h>

#include "slex.h" 

/* The preprocessor symbol SAPC is #defined in $pcinc/stdio.h.  This

 * stdio.h is found by i386-gcc because of the -I flag in its compile command

 * in the Makefile.  In the UNIX case, there is no such redirection,

 * so the ordinary stdio.h is used, and it has no SAPC definition.

 */

#ifdef SAPC

#define PROMPT "PC-tutor> "

#else

#define PROMPT "UNIX-tutor> "

#endif

int main(void);

void getcmd(char *, int *, int *);



int main()

{

  int done = 0;

  int cnum,linepos;

  char linebuf[LINELEN];

  Cmd *cp;



  printf("     cmd    help message\n");

  for(cp = cmds; cp->cmdtoken; cp++) 

      printf("%8s    %s\n", cp->cmdtoken, cp->help);



  while (!done) {

    /* get cmd token from user by parsing first part of line in linebuf-- */

    getcmd(linebuf,&cnum,&linepos);

    /* call implementation routine for matched cmd-- */

    /* (remaining part of line to parse starts at linebuf+linepos) */

    done = cmds[cnum].cmdfn(&cmds[cnum], linebuf+linepos); 

  }

  return 0;

}



/***********************************************************************

*

*  getcmd 

*

* Better than scanf--read whole line in, parse resulting string.

* Uses slex package to match cmd token in first part of linebuf 

* and return command # and where to continue parsing.

* Getcmd loops until user provides proper command, so no error return.

*/

void getcmd(char *linebuf, 

             int *cnum_ptr,   /* returned command number */

             int *pos_ptr     /* position in linebuf (after cmd token) */

           )

{

  int done = 0;



  while (!done) {

     printf( PROMPT );

     gets(linebuf);		/* read line from user, null terminate */

     /* match cmd token to get cnum--call slex package to do lookup-- */

     if (slex( linebuf, cmds, cnum_ptr, pos_ptr)==0) 

         done = 1;	/* success in matching cmd */

     else

         printf(" No such command\n");

  }

}

tuser@tutor-vserver:~$ make clear[Kn
make: *** No rule to make target `clean'.  Stop.
tuser@tutor-vserver:~$ mtip0[K -f tutor.lnx
For command help, type ~?
For help on args, rerun without args
Code starts at 0x100100
Using board # 1 

Please type <CR> to confirm console setting: 
Setting console dev to COM2Console: colour EGA+ 80x25
COM1 at 0x03f8 (irq = 4) is a 16550A
COM2 at 0x02f8 (irq = 3) is a 16550A

                 Welcome to UMB Tutor for the PC
   UMB Tutor is a 32-bit protected-mode PC debugger/downloader,
       based on Linux, UMB Tutor for m68k, and remote gdb.
UMB Tutor is free software and you are welcome to distribute copies
of it under certain conditions.  There is no warranty for this program.
The copyright and warranty provisions follow the Gnu general public
license, available for view in gdb and elsewhere.  Full sources available.
--bugs, suggestions, questions to eoneil@cs.umb.edu

Exception 3 at EIP=00057a9b: Breakpoint
Tutor> go 10001  100

Exception 13 at EIP=0010010c: General protection violation
Tutor> ~downloading tutor.lnx

..........Done.



Download done, setting EIP to 100100.
Tutor> go 10001  100

     cmd    help message
      md    Memory display: MD <addr>
       s    Stop
      ms    Memory Set: MS <addr> <value>
       h    Help: H <command>
PC-tutor> md 10000
disaddr = p	  content = 1057824
00010000  ea 05 00 c0 07 8c c8 8e d8 8e c0 8e d0 31 e4 fb .............1..
PC-tutor> md 10010023
disaddr = p	  content = 1057824
00100100  bc f0 ff 3f 00 bd 00 00 00 00 e8 01 00 00 00 cc ...?............
PC-tutor> md 123
 No such command
PC-tutor> ,dmd 
 No such command
PC-tutor> md xyz
disaddr = p	  content = 1057824
        help message: Memory display: MD <addr>
PC-tutor> ms xyz
        help message: Memory Set: MS <addr> <value>
PC-tutor> md xyz xytz
disaddr = p	  content = 1057824
        help message: Memory display: MD <addr>
PC-tutor> ms xyz xyz
        help message: Memory Set: MS <addr> <value>
PC-tutor> md 123456
disaddr = p	  content = 1057824
00123456  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 ................
PC-tutor> md 123456 12
disaddr = p	  content = 1057824
00123456  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 ................
PC-tutor> md
 No such command
PC-tutor> ms 123456 123
Ok/nPC-tutor> md 123456
disaddr = p	  content = 1057824
00123456  23 01 00 00 00 00 00 00 00 00 00 00 00 00 00 00 #...............
PC-tutor> h s
  cmd   help message
       s   Stop
PC-tutor>  rd
 No such command
PC-tutor> ireg
 No such command
PC-tutor> rd md
 No such command
PC-tutor> rd
 No such command
PC-tutor> ms
        help message: Memory Set: MS <addr> <value>
PC-tutor> md 234
disaddr = p	  content = 1057824
00000234  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 ................
PC-tutor> md 234 1
disaddr = p	  content = 1057824
00000234  00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 ................
PC-tutor> md a
disaddr = p	  content = 1057824
        help message: Memory display: MD <addr>
PC-tutor> ms 123 4
Ok/nPC-tutor> md 123
disaddr = p	  content = 1057824
00000123  04 56 0d 00 f0 56 0d 00 f0 56 0d 00 f0 56 0d 00 .V...V...V...V..
PC-tutor> ms 234
        help message: Memory Set: MS <addr> <value>
PC-tutor> ms 234 6
Ok/nPC-tutor> md 234
disaddr = p	  content = 1057824
00000234  06 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 ................
PC-tutor> md 1001000
disaddr = p	  content = 1057824
01001000  Exception 14 at EIP=0010048c: Page fault
Tutor> sw 

No such command: s, use h command for help
Tutor> s j

No such command: j, use h command for help
Tutor> j h

Display help      : H [command]
Register Display  : RD [ALL]
Register Set      : RS <reg> <val>
Memory Display    : MD <addr>
Memory DW Display : MDD <addr>
Memory Set        : MS <addr> <val> [<val>...]
Port Display      : PD <port>
Port Set          : PS <port> <val> [<val>...]
Device Display    : DD
Device Set        : DS <dev> HL|CON|INIT|BOOT|BAUD <bps>
Device TestPattern: DT <dev> [HWFC|SWFC|NONE] [<linecount>]
Transparent Mode  : TM [<escapechar>]
Download          : LO
Go, start/resume  : GO [<addr>]
Disp/Set breakpt  : B [<addr>]
Delete breakpt    : D [<addr>]
Trace             : T
Remote gdb        : GDB [<dev>]
<dev> is KBMON|COM1|COM2...|CON|HL, CON for console, HL for hostline.
<CR> repeats DT, MD, MDD, PD, and T commands.  Hex except baudrate.
Tutor> 1 md 100100

00100100    bc f0 ff 3f 00 bd 00 00 00 00 e8 01 00 00 00 cc ...?............
Tutor> ms 100100 23

Tutor> md 100100

00100100    23 f0 ff 3f 00 bd 00 00 00 00 e8 01 00 00 00 cc #..?............
Tutor> ps 100100

Tutor> md 100100

00100100    23 f0 ff 3f 00 bd 00 00 00 00 e8 01 00 00 00 cc #..?............
Tutor> d 100100

No breakpoint at 100100
Tutor> d1  exit

No such command: exit, use h command for help
Tutor> ~q 
Quit handler: 
killing process 2317 Leaving board #1
tuser@tutor-vserver:~$ exit
exit

Script done on Sun 10 Oct 2021 10:36:59 PM EDT